Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source2.tmx
Source language: en_us
Languages: ja

source: Returns a Boolean value indicating whether two values are equal.
ja: ２つの値が等しいかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether two values are not equal.
ja: ２つの値が等しくないかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether two vectors are equal.
ja: ２つのベクターが等しいかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether a given element is a member of the option set.
ja: 与えられた要素がオプションセットのメンバであるかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether the given element exists in the set.
ja: 与えられた要素が集合の中の存在するかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether the set has no members in common with the given sequence.
ja: この集合は与えられたシーケンスと共通のメンバを１つも持たないかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether the set has no members in common with the given set.
ja: この集合が、与えられた集合と共通のメンバを１つも持たないかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether the set is a strict subset of the given sequence.
ja: この集合は与えられたシーケンスの狭義の下位集合であるかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether the set is a strict superset of the given sequence.
ja: この集合は与えられたシーケンスの狭義の上位集合であるかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether the set is a subset of another set.
ja: この集合は別の集合の下位集合であるかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether the set is a subset of the given sequence.
ja: この集合は与えられたシーケンスの下位集合であるかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether the set is a superset of the given sequence.
ja: この集合は与えられたシーケンスの上位集合であるかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether the set is a superset of the given set.
ja: この集合が、与えられた集合の上位集合であるかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether this set has no members in common with the given set.
ja: この集合は与えられた集合と共通のメンバを１つも持たないかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether this set is a strict subset of the given set.
ja: この集合は与えられた集合の狭義の下位集合であるかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether this set is a strict superset of the given set.
ja: この集合は与えられた集合の狭義の上位集合であるかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether this set is a subset of the given set.
ja: この集合は与えられた集合の下位集合であるかどうかを指し示すブール値を返します。

source: Returns a Boolean value that indicates whether this set is a superset of the given set.
ja: この集合は与えられた集合の上位集合であるかどうかを指し示すブール値を返します。

source: Returns a closed range that contains both of its bounds.
ja: それの境界の両方を含む完結範囲を返します。

source: Returns a copy of this range clamped to the given limiting range.
ja: 与えられた限界範囲に締め金具で留められる（制限を課される）、この範囲のコピーを返します。

source: Returns a copy of this vector, with elements other in the lanes where mask is true.
ja: このベクターのコピーを返します、maskがtrueであるところの、レーンの中の要素otherを持ちます。

source: Returns a copy of this vector, with elements replaced by elements of other in the lanes where mask is true.
ja: このベクターのコピーを返します、maskがtrueであるところの、レーンの中の要素otherを持ちます。

source: Returns a half-open range that contains its lower bound but not its upper bound.
ja: それの下側の境界は含むがそれの上側の境界はそうしない半開範囲を返します。

source: Returns a lazy sequence of the initial consecutive elements that satisfy predicate.
ja: predicateを満足させる、冒頭の隣接要素からなるある遅延シーケンスを返します。

source: Returns a lazy sequence that concatenates the elements of this sequence of sequences.
ja: このシーケンスに属する複数のシーケンスの要素を鎖状に連結する遅延シーケンスを返します。

source: Returns a lazy sequence that skips any initial elements that satisfy predicate.
ja: predicateを満足させる、あらゆる冒頭の要素を省くある遅延シーケンスを返します。

source: Returns a new collection of the same type containing, in order, the elements of the original collection that satisfy the given predicate.
ja: オリジナルのコレクションの要素で与えられた述部を満たすものを、順序正しく、含んでいる同じ型の新しいコレクションを返します。

source: Returns a new option set of the elements contained in this set, in the given set, or in both.
ja: このセットの中に、与えられたセットの中に、または両方の中に、含まれる要素からなる新しいオプションセットを返します。

source: Returns a new option set with only the elements contained in both this set and the given set.
ja: このセットと与えられたセットの両方の中に含まれる要素だけを持つ新しいオプションセットを返します。

source: Returns a new option set with the elements contained in this set or in the given set, but not in both.
ja: このセットの中にまたは与えられたセットの中に、しかし両方の中にではなく、含まれる要素からなる新しいオプションセットを返します。

source: Returns a new result, mapping any failure value using the given transformation and unwrapping the produced result.
ja: 新しい結果を返します、あらゆる失敗値をこの与えられた変換を使ってマッピングします、そして生成された結果をアンラップします。

source: Returns a new result, mapping any failure value using the given transformation.
ja: 新しい結果を返します、あらゆる失敗値をこの与えられた変換を使ってマッピングします。

source: Returns a new result, mapping any success value using the given transformation and unwrapping the produced result.
ja: 新しい結果を返します、あらゆる成功値をこの与えられた変換を使ってマッピングしています、そして生成された結果をアンラップしています。

source: Returns a new result, mapping any success value using the given transformation.
ja: 新しい結果を返します、あらゆる成功値をこの与えられた変換を使ってマッピングします。

source: Returns a new set containing the elements of the set that satisfy the given predicate.
ja: この集合の要素で与えられた述部を満たすものを含んでいる新しい集合を返します。

source: Returns a new set containing the elements of this set that do not occur in the given sequence.
ja: 与えられたシーケンスの中の現れないこの集合の要素を含んでいる新しい集合を返します。

source: Returns a new set containing the elements of this set that do not occur in the given set.
ja: 与えられた集合の中の現れないこの集合の要素を含んでいる新しい集合を返します。

source: Returns a new set with the elements of both this and the given set.
ja: これと与えられた集合の両方の要素を持つ新しい集合を返します。

source: Returns a new set with the elements of both this set and the given sequence.
ja: この集合と与えられたシーケンスの両方の要素を持つ新しい集合を返します。

source: Returns a new set with the elements that are common to both this set and the given sequence.
ja: この集合と与えられたシーケンスの両方に共通である要素を持つ新しい集合を返します。

source: Returns a new set with the elements that are common to both this set and the given set.
ja: この集合と与えられた集合の両方に共通である要素を持つ新しい集合を返します。

source: Returns a new set with the elements that are either in this set or in the given sequence, but not in both.
ja: この集合の中か与えられたシーケンスの中かどちらかの、しかし両方の中にではない要素を持つ新しい集合を返します。

source: Returns a new set with the elements that are either in this set or in the given set, but not in both.
ja: この集合の中か与えられた集合の中かどちらかの、しかし両方の中にではない要素を持つ新しい集合を返します。

source: Returns a new string by concatenating the elements of the sequence, adding the given separator between each element.
ja: 各要素の間に与えられた分離子を加えて、シーケンスの要素を連結することによる新しい文字列を返します。

source: Returns a partial range extending upward from a lower bound.
ja: 下側の境界から上方に拡張している部分的な範囲を返します。

source: Returns a partial range up to, and including, its upper bound.
ja: それの上側の境界までの、そしてそれを含む部分的な範囲を返します。

source: Returns a partial range up to, but not including, its upper bound.
ja: それの上側の境界までの、しかしそれを含んでいない、部分的な範囲を返します。

source: Returns a random element of the collection, using the given generator as a source for randomness.
ja: コレクションのある無作為な要素を返します、与えられた生成子を無作為さの出典として使って使います。

source: Returns a random element of the collection.
ja: コレクションのある無作為の要素を返します。

source: Returns a random value that is less than the given upper bound.
ja: 与えられた上側の境界より小さい無作為の値を返します。

source: Returns a random value within the specified range, using the given generator as a source for randomness.
ja: 指定された範囲内のある無作為な値を返します、与えられた生成子を無作為さの出典として使って使います。

source: Returns a random value within the specified range.
ja: 指定された範囲内のある無作為の値を返します。

source: Returns a sequence by skipping the initial, consecutive elements that satisfy the given predicate.
ja: 与えられた述部を満たす、冒頭の、隣接する要素を飛ばすことによるあるシーケンスを返します。

source: Returns a sequence containing all but the given number of final elements.
ja: 与えられた数の末尾要素以外すべてを含んでいるあるシーケンスを返します。

source: Returns a sequence containing all but the given number of initial elements.
ja: 指定された数の冒頭要素以外すべてを含んでいるあるシーケンスを返します。

source: Returns a sequence containing the initial, consecutive elements that satisfy the given predicate.
ja: 与えられた述部を満たす、冒頭の、隣接する要素を含んでいるあるシーケンスを返します。

source: Returns a sequence of pairs (n, x), where n represents a consecutive integer starting at zero and x represents an element of the sequence.
ja: ペア (n, x) のシーケンスを返します、そこでnはゼロで開始する連続した数を表して、xはシーケンスの要素を表します。

source: Returns a sequence, up to the specified maximum length, containing the initial elements of the sequence.
ja: 指定された最大長まで、そのシーケンスの冒頭の要素を含んでいる、あるシーケンスを返します。

source: Returns a specific descendant of the reflected subject, or nil if no such descendant exists.
ja: リフレクションされている主題の特定の子孫を返します、またはそのような子孫が存在しないならばnil。

source: Returns a subsequence by skipping elements while predicate returns true and returning the remaining elements.
ja: predicateがtrueを返す間は要素を飛ばして残りの要素を返すことによって、ある下位シーケンスを返します。

source: Returns a subsequence containing all but the given number of initial elements.
ja: 指定された数の冒頭要素以外すべてを含んでいる下位シーケンスを返します。

source: Returns a subsequence containing all but the specified number of final elements.
ja: 指定された数の末尾要素以外すべてを含んでいる下位シーケンスを返します。

source: Returns a subsequence containing the initial elements until predicate returns false and skipping the remaining elements.
ja: predicateがfalseを返すまで冒頭の要素を含んでいて残りの要素を飛ばしている、ある下位シーケンスを返します。

source: Returns a subsequence from the specified position to the end of the collection.
ja: 指定された位置からコレクションの終わりまでの下位シーケンスを返します。

source: Returns a subsequence from the start of the collection through the specified position.
ja: コレクションの始まりから指定された位置までも含む下位シーケンスを返します。

source: Returns a subsequence from the start of the collection up to, but not including, the specified position.
ja: コレクションの始まりから指定された位置まで、しかしそれは含めない下位シーケンスを返します。

source: Returns a subsequence, up to the given maximum length, containing the final elements of the collection.
ja: 下位シーケンスを、指定された最大長まで、コレクションの末尾の要素を含めて返します。

source: Returns a subsequence, up to the given maximum length, containing the final elements of the sequence.
ja: 下位シーケンスを、指定された最大長まで、シーケンスの末尾の要素を含めて返します。

source: Returns a subsequence, up to the specified maximum length, containing the initial elements of the collection.
ja: 下位シーケンスを、指定された最大長まで、コレクションの冒頭の要素を含めて返します。

source: Returns a tuple containing the high and low parts of the result of multiplying this value by the given value.
ja: この値を指定の値で掛ける結果の高および低部分を含んでいるタプルを返します。

source: Returns a tuple containing the quotient and remainder of dividing the given value by this value.
ja: 与えられた値をこの値で除算した商と余りを含んでいるタプルを返します。

source: Returns a value from a uniform, independent distribution of binary data.
ja: バイナリデータの一様な、独立分布からの値を返します。

source: Returns a value that is offset the specified distance from this value.
ja: 指定の隔たりをこの値からオフセットされたある値を返します。

source: Returns a vector mask with the result of a pointwise equality comparison.
ja: ポイント単位同等比較の結果を持つベクターマスクを返します。

source: Returns a vector mask with the result of a pointwise greater than comparison.
ja: ポイント単位大なり比較の結果を持つベクターマスクを返します。

source: Returns a vector mask with the result of a pointwise greater than or equal comparison.
ja: ポイント単位大なり同等比較の結果を持つベクターマスクを返します。

source: Returns a vector mask with the result of a pointwise inequality comparison.
ja: ポイント単位不等比較の結果を持つベクターマスクを返します。

source: Returns a vector mask with the result of a pointwise less than comparison.
ja: ポイント単位小なり比較の結果を持つベクターマスクを返します。

source: Returns a vector mask with the result of a pointwise less than or equal comparison.
ja: ポイント単位小なり同等比較の結果を持つベクターマスクを返します。

source: Returns a vector with random values from within the specified range in all lanes, using the given generator as a source for randomness.
ja: 全てのレーンにおいてこの指定された範囲内から無作為な値を持つベクターを返します、与えられた生成子を無作為さの出典として使って使います。

source: Returns a vector with random values from within the specified range in all lanes.
ja: 全てのレーンにおいてこの指定された範囲内から無作為な値を持つベクターを返します。

source: Returns a view presenting the elements of the collection in reverse order.
ja: コレクションの要素を逆順に表しているある見方を返します。

source: Returns an array containing the concatenated results of calling the given transformation with each element of this sequence.
ja: 指定された変換をこのシーケンスの各要素で呼び出す結果を連結したものを含んでいる配列を返します。

source: Returns an array containing the elements of this sequence in reverse order.
ja: このシーケンスの要素を逆順に含んでいる配列を返します。

source: Returns an array containing the non-nil results of calling the given transformation with each element of this sequence.
ja: 指定された変換をこのシーケンスの各要素で呼び出す結果で非-nilのものを含んでいる配列を返します。

source: Returns an array containing the results of mapping the given closure over the sequence’s elements.
ja: 与えられたクロージャをシーケンスのもつ要素全体にわたってマップする結果を含んでいる配列を返します。

source: Returns an array containing, in order, the elements of the sequence that satisfy the given predicate.
ja: 指定された述部を満足させるものであるシーケンスの要素を、順序通りに、含んでいる配列を返します。

source: Returns an index that is the specified distance from the given index, unless that distance is beyond a given limiting index.
ja: 与えられたインデックスから指定された隔たりのインデックスを返します、その隔たりが与えられた限界インデックスを越えない限りは。

source: Returns an index that is the specified distance from the given index.
ja: 与えられたインデックスから指定された隔たりのインデックスを返します。

source: Returns an iterator for this sequence.
ja: このシーケンスに対するイテレータを返します。

source: Returns an iterator over the elements of the collection.
ja: コレクションの要素すべてを対象としたイテレータを返します。

source: Returns an iterator over the elements of this sequence.
ja: このシーケンスの要素すべてを対象としたあるイテレータを返します。

source: Returns an iterator over the members of the set.
ja: 集合のメンバすべてを対象とするイテレータを返します。

source: Returns the additive inverse of the specified value.
ja: 指定された値の加法の逆元を返します。

source: Returns the concatenated elements of this sequence of sequences, inserting the given separator between each element.
ja: 各要素の間に与えられた分離子を挿入して、このシーケンスに属する複数のシーケンスの要素を鎖状に連結して返します。

source: Returns the concatenated results of mapping the given transformation over this sequence.
ja: 与えられた変換をこのシーケンス全体にわたってマッピングする結果を鎖状に連結して返します。

source: Returns the contiguous memory footprint of the given instance.
ja: 与えられたインスタンスの隣接メモリフットプリントを返します。

source: Returns the data stored for the given key as represented in a container keyed by the given key type.
ja: 与えられたキーに対して格納されるデータを、与えられたキー型によってキー付けされるコンテナの中に表される通りに返します。

source: Returns the data stored for the given key as represented in an unkeyed container.
ja: 与えられたキーに対して格納されるデータを、キー無しコンテナにおいて表現される通りに返します。

source: Returns the default memory alignment of T.
ja: Tの省略時のメモリアライメントを返します。

source: Returns the difference needed to produce this collection’s ordered elements from the given collection, using the given predicate as an equivalence test.
ja: このコレクションのもつ順番付けられた要素をこの与えられたコレクションから生成するのに必要とされる差異を返します、与えられた述部を同等性テストとして使います。

source: Returns the difference needed to produce this collection’s ordered elements from the given collection.
ja: このコレクションのもつ順番付けられた要素をこの与えられたコレクションから生成するのに必要とされる差異を返します。

source: Returns the difference obtained by subtracting the given value from this value, along with a Boolean value indicating whether overflow occurred in the operation.
ja: 与えられた値をこの値から減じることで入手される差、それに加えてオーバーフローがその演算において起こったかどうかを示すブール値を返します。

source: Returns the difference of the two given values, wrapping the result in case of any overflow.
ja: ２つの与えられた値の差を返します、何らかのオーバーフローの場合には結果をラップします。

source: Returns the distance between two indices.
ja: ２つのインデックス間の隔たりを返します。

source: Returns the distance from this value to the given value, expressed as a stride.
ja: この値から特定の値までの隔たりを返します、ストライドとして表されます。

source: Returns the dynamic type of a value.
ja: ある値の動的型を返します。

source: Returns the elements of self that satisfy isIncluded.
ja: selfの要素でisIncludedを満足させるものを返します。

source: Returns the elements of the sequence, shuffled using the given generator as a source for randomness.
ja: シーケンスの要素を返します、与えられた生成子を無作為さの出典として使って混ぜ合わされます。

source: Returns the elements of the sequence, shuffled.
ja: 入れ替えた、シーケンスの要素を返します。

source: Returns the elements of the sequence, sorted using the given predicate as the comparison between elements.
ja: 与えられた述部を要素間の比較として使ってソートされた、シーケンスの要素を返します。

source: Returns the elements of the sequence, sorted.
ja: シーケンスに属する要素を、ソートして返します。

source: Returns the elements of this sequence of sequences, concatenated.
ja: このシーケンスに属する複数のシーケンスの要素を、鎖状に連結して返します。

source: Returns the first element of the sequence that satisfies the given predicate.
ja: 与えられた述部を満たすこのシーケンスの最初の要素を返します。

source: Returns the first index in which an element of the collection satisfies the given predicate.
ja: 最初のインデックスで、それにおけるコレクションの要素が与えられた述部を満足させるものを返します。

source: Returns the first index where the specified value appears in the collection.
ja: 指定された値がコレクションにおいて現れるところの最初のインデックスを返します。

source: Returns the given number unchanged.
ja: 与えられた数を変更せずに返します。

source: Returns the index of the given element in the set, or nil if the element is not a member of the set.
ja: 与えられた要素の集合の中のインデックス、またはその要素が集合のメンバでないならばnilを返します。

source: Returns the index of the last element in the collection that matches the given predicate.
ja: 与えられた述部に合致する、コレクションの中の最後の要素のインデックスを返します。

source: Returns the inverse of the bits set in the argument.
ja: 引数におけるビットの逆順を返します。

source: Returns the last element of the sequence that satisfies the given predicate.
ja: 与えられた述部を満たす、シーケンスの最後の要素を返します。

source: Returns the last index where the specified value appears in the collection.
ja: 指定された値がコレクションにおいて現れるところの最後のインデックスを返します。

source: Returns the longest possible subsequences of the collection, in order, around elements equal to the given element.
ja: 与えられた要素と等しい要素を避けるようにして、このコレクションの最も長くなりうる下位シーケンスを、順番に返します。

source: Returns the longest possible subsequences of the collection, in order, that don’t contain elements satisfying the given predicate.
ja: 与えられた述部を満たす要素を含んでいない、このコレクションの最も長くなりうる下位シーケンスそれらを順序どおりに返します。

source: Returns the longest possible subsequences of the sequence, in order, around elements equal to the given element.
ja: 与えられた要素と等しい要素を避けるようにして、このシーケンスの最も長くなりうる下位シーケンスを、順番に返します。

source: Returns the longest possible subsequences of the sequence, in order, that don’t contain elements satisfying the given predicate.
ja: 与えられた述部を満たす要素を含んでいない、このシーケンスの最も長くなりうる下位シーケンスそれらを順序どおりに返します。

source: Returns the maximum element in the sequence, using the given predicate as the comparison between elements.
ja: シーケンスの中の最大の要素を返します、与えられた述部を要素間の比較として使います。

source: Returns the maximum element in the sequence.
ja: シーケンスの中の最大の要素を返します。

source: Returns the minimum element in the sequence, using the given predicate as the comparison between elements.
ja: シーケンスの中の最小の要素を返します、与えられた述部を要素間の比較として使います。

source: Returns the minimum element in the sequence.
ja: シーケンスの中の最小の要素を返します。

source: Returns the non-nil results of mapping the given transformation over this sequence.
ja: 与えられた変換をこのシーケンス全体にわたってマッピングする非nilの結果を返します。

source: Returns the number of bytes from the start of one instance of T to the start of the next when stored in contiguous memory or in an Array<T>.
ja: Tの１つのインスタンスの始まりから次のものの始まりまでのバイト数を返します、隣接メモリの中にまたはArray<T>の中に格納される場合。

source: Returns the number of elements.
ja: 要素の数を返します。

source: Returns the object instance being used for storage.
ja: ストレージのために使われているオブジェクトインスタンスを返します。

source: Returns the offset of an inline stored property within a type’s in-memory representation.
ja: インライン格納プロパティの、ある型のもつインメモリ表現内部でのオフセットを返します。

source: Returns the position immediately after the given index.
ja: 与えられたインデックスの直後の位置を返します。

source: Returns the position immediately before the given index.
ja: 与えられたインデックスの直前の位置を返します。

source: Returns the product of the two given values, wrapping the result in case of any overflow.
ja: ２つの与えられた値の積を返します、何らかのオーバーフローの場合には結果をラップします。

source: Returns the product of this value and the given value, along with a Boolean value indicating whether overflow occurred in the operation.
ja: この値と与えられた値の積、それに加えてオーバーフローがその演算において起こったかどうかを示すブール値を返します。

source: Returns the quotient and remainder of this value divided by the given value.
ja: 与えられた値で除算されたこの値の商と余りを返します。

source: Returns the quotient obtained by dividing this value by the given value, along with a Boolean value indicating whether overflow occurred in the operation.
ja: この値を指定の値で割ることで入手される商、それに加えてオーバーフローがその演算において起こったかどうかを示すブール値を返します。

source: Returns the quotient of dividing the first value by the second.
ja: 最初の値を２番目の値で除算した商を返します。

source: Returns the range of indices described by this range expression within the given collection.
ja: 与えられたコレクション内の、この範囲式によって記述されるインデックスの範囲を返します。

source: Returns the remainder after dividing this value by the given value, along with a Boolean value indicating whether overflow occurred during division.
ja: この値を指定の値によって除算する後の余り、それに加えてオーバーフローが除算の間に起こったかどうかを示すブール値を返します。

source: Returns the remainder of dividing the first value by the second.
ja: 最初の値を２番目の値で除算した余りを返します。

source: Returns the result of combining the elements of the sequence using the given closure.
ja: 与えられたクロージャを使って、このシーケンスの要素それらを結合する結果を返します。

source: Returns the result of performing a bitwise AND operation on the two given values.
ja: ビット単位AND演算を２つの与えられた値に関して実行する結果を返します。

source: Returns the result of performing a bitwise OR operation on the two given values.
ja: ビット単位OR演算を２つの与えられた値に関して実行する結果を返します。

source: Returns the result of performing a bitwise XOR operation on the two given values.
ja: ビット単位XOR演算を２つの与えられた値に関して実行する結果を返します。

source: Returns the result of shifting a value’s binary representation the specified number of digits to the left, masking the shift amount to the type’s bit width, and stores the result in the left-hand-side variable.
ja: ある値のバイナリ表現を指定された桁数だけ左にシフトする結果を返します、シフト量をその型のもつビット幅にマスクしています、そして結果を左手側の変数に格納します。

source: Returns the result of shifting a value’s binary representation the specified number of digits to the left, masking the shift amount to the type’s bit width.
ja: ある値のバイナリ表現を指定された桁数だけ左にシフトする結果を返します、シフト量をマスクしてその型のもつビット幅にしています。

source: Returns the result of shifting a value’s binary representation the specified number of digits to the left.
ja: ある値のバイナリ表現を指定された桁数だけ左にシフトする結果を返します。

source: Returns the result of shifting a value’s binary representation the specified number of digits to the right, masking the shift amount to the type’s bit width.
ja: ある値のバイナリ表現を指定された桁数だけ右にシフトする結果を返します、シフト量をその型のもつビット幅にマスクしています。

source: Returns the result of shifting a value’s binary representation the specified number of digits to the right.
ja: ある値のバイナリ表現を指定された桁数だけ右にシフトする結果を返します。

source: Returns the success value as a throwing expression.
ja: 成功値をスローする式として返します。

source: Returns the sum of the scalars in the vector, computed with wrapping addition.
ja: ベクターの中のスカラーそれらの合計を返します、加算をラップすることで計算されます。

source: Returns the sum of the two given values, wrapping the result in case of any overflow.
ja: ２つの与えられた値の合計を返します、何らかのオーバーフローの場合には結果をラップします。

source: Returns the sum of this value and the given value, along with a Boolean value indicating whether overflow occurred in the operation.
ja: この値と与えられた値の合計、それに加えてオーバーフローがその演算において起こったかどうかを示すブール値を返します。

source: Reuse the Existing Implementation
ja: 既存の実装を再利用する

source: Reverses the elements of the collection in place.
ja: コレクションの要素をその場で逆順にします。

source: Reversing a Set's Elements
ja: 集合の要素を逆順にする

source: Reversing a reversed collection returns the original collection.
ja: 逆にされたコレクションを逆にすることは、元のコレクションを返します。

source: Right shift operations on negative values “fill in” the high bits with ones instead of zeros.
ja: 負値上での右シフト演算は、高ビットを１で「満たします」、ゼロではなく。

source: Running the analysis on a sufficiently large sample generates an average number near 50 and a failure rate near 50%:
ja: 十分に大きなサンプル上での分析の実行は、50に近い平均数と50%に近い失敗割合を生成します：

source: Running the code in the example above usually prints the letters in the order B → C → D → A.
ja: 上の例のコードを実行することは、通常は文字をこの順番で出力します、B → C → D → A。

source: S() == []
ja: S() == [] （空の集合は空の配列リテラルと同等です）

source: SIMD Implementations
ja: SIMD実装

source: SIMD Vector Types
ja: SIMDベクター型

source: SIMD Vectors
ja: SIMDベクター

source: See isKnownUniquelyReferenced for details.
ja: isKnownUniquelyReferencedを詳細として見てください。

source: See also: LazySequenceProtocol
ja: 参照：LazySequenceProtocol
